Performance/Results/2026-09-17-batched-ab/1-http-server-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  126.01us   3.92ms   76.94%
    Req/Sec    15.88k   400.37    16.90k    63.73%
  Latency Distribution
     50%    1.00ms
     75%    1.07ms
     90%    1.13ms
     99%    1.38ms
  322212 requests in 5.10s, 24.89MB read
Requests/sec:  63171.52
Transfer/sec:      4.88MB

METRICS {"requests":322212,"duration_us":5100590,"bytes":26099172,"p50_us":999,"p99_us":1381,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}