Performance/Results/2026-09-17-batched-ab/2-http-server-batched-large-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/large
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms  174.83us   3.25ms   78.39%
    Req/Sec    10.97k   334.81    11.80k    73.04%
  Latency Distribution
     50%    1.41ms
     75%    1.53ms
     90%    1.65ms
     99%    2.06ms
  222808 requests in 5.10s, 13.62GB read
Requests/sec:  43682.75
Transfer/sec:      2.67GB

METRICS {"requests":222808,"duration_us":5100595,"bytes":14620438152,"p50_us":1412,"p99_us":2057,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}