Performance/Results/2026-09-17-batched-ab/2-http-server-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms  150.17us   3.19ms   79.86%
    Req/Sec    16.09k   509.69    17.95k    76.96%
  Latency Distribution
     50%    0.96ms
     75%    1.06ms
     90%    1.15ms
     99%    1.53ms
  326459 requests in 5.10s, 25.22MB read
Requests/sec:  64005.82
Transfer/sec:      4.94MB

METRICS {"requests":326459,"duration_us":5100458,"bytes":26443179,"p50_us":964,"p99_us":1528,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}