Performance/Results/2026-09-17-batched-ab/3-hummingbird-large-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/large
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.37ms  132.07us   4.07ms   83.34%
    Req/Sec    11.56k   344.68    12.10k    84.31%
  Latency Distribution
     50%    1.35ms
     75%    1.42ms
     90%    1.50ms
     99%    1.84ms
  234729 requests in 5.10s, 14.35GB read
Requests/sec:  46022.20
Transfer/sec:      2.81GB

METRICS {"requests":234729,"duration_us":5100343,"bytes":15411367224,"p50_us":1354,"p99_us":1843,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}