Performance/Results/2026-09-17-batched-ab/3-vapor-batched-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.85ms    1.28ms  27.98ms   97.23%
    Req/Sec    21.29k     3.22k   45.32k    86.14%
  Latency Distribution
     50%  644.00us
     75%  830.00us
     90%    1.14ms
     99%    5.64ms
  428051 requests in 5.10s, 33.07MB read
Requests/sec:  83918.64
Transfer/sec:      6.48MB

METRICS {"requests":428051,"duration_us":5100786,"bytes":34672131,"p50_us":644,"p99_us":5645,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}