Performance/Results/2026-09-17-batched-ab/3-vapor-large-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/large
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.62ms  201.29us   6.06ms   86.19%
    Req/Sec     9.77k   232.05    10.29k    67.16%
  Latency Distribution
     50%    1.61ms
     75%    1.69ms
     90%    1.78ms
     99%    2.32ms
  198349 requests in 5.10s, 12.12GB read
Requests/sec:  38883.25
Transfer/sec:      2.38GB

METRICS {"requests":198349,"duration_us":5101143,"bytes":13015512110,"p50_us":1609,"p99_us":2316,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}