Performance/Results/2026-09-17-batched-ab/3-vapor4-large-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/large
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.30ms  139.19us   3.91ms   87.03%
    Req/Sec    12.23k   608.08    17.38k    97.54%
  Latency Distribution
     50%    1.29ms
     75%    1.35ms
     90%    1.42ms
     99%    1.74ms
  247008 requests in 5.10s, 15.11GB read
Requests/sec:  48431.28
Transfer/sec:      2.96GB

METRICS {"requests":247008,"duration_us":5100175,"bytes":16223485440,"p50_us":1291,"p99_us":1743,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}